# *In this problem we have to write a SQL to build a team with a combination of seniors and juniors within a given salary budget(70,000)* #

In [1]:
%create example.db

In [17]:
create table candidates (
emp_id int,
experience varchar(20),
salary int
);

In [19]:
insert into candidates values
(1,'Junior',10000),(2,'Junior',15000),(3,'Junior',40000),(4,'Senior',16000),(5,'Senior',20000),(6,'Senior',50000);

In [20]:
select * from candidates

+--------+------------+--------+
| emp_id | experience | salary |
+--------+------------+--------+
| 1      | Junior     | 10000  |
+--------+------------+--------+
| 2      | Junior     | 15000  |
+--------+------------+--------+
| 3      | Junior     | 40000  |
+--------+------------+--------+
| 4      | Senior     | 16000  |
+--------+------------+--------+
| 5      | Senior     | 20000  |
+--------+------------+--------+
| 6      | Senior     | 50000  |
+--------+------------+--------+

In [32]:
with total_sal as (select *, 
    sum(salary) over(partition by experience order by salary rows between unbounded preceding and current row) as running_sal

from candidates),

seniors as( select * from total_sal
where experience= 'Senior' and running_sal<=70000)

select * from total_sal
where experience= 'Junior' 
    and running_sal<= 70000 -(select sum(salary) from seniors)

union all

select * from seniors

+--------+------------+--------+-------------+
| emp_id | experience | salary | running_sal |
+--------+------------+--------+-------------+
| 1      | Junior     | 10000  | 10000       |
+--------+------------+--------+-------------+
| 2      | Junior     | 15000  | 25000       |
+--------+------------+--------+-------------+
| 4      | Senior     | 16000  | 16000       |
+--------+------------+--------+-------------+
| 5      | Senior     | 20000  | 36000       |
+--------+------------+--------+-------------+

In [29]:
with total_sal as (select *, 
    sum(salary) over(partition by experience order by salary ) as running_sal

from candidates)
select * from total_sal
where experience= 'Senior' and running_sal<=70000

+--------+------------+--------+-------------+
| emp_id | experience | salary | running_sal |
+--------+------------+--------+-------------+
| 4      | Senior     | 16000  | 16000       |
+--------+------------+--------+-------------+
| 5      | Senior     | 20000  | 36000       |
+--------+------------+--------+-------------+

In [30]:
select *, 
    sum(salary) over(partition by experience order by salary ) as running_sal

from candidates

+--------+------------+--------+-------------+
| emp_id | experience | salary | running_sal |
+--------+------------+--------+-------------+
| 1      | Junior     | 10000  | 10000       |
+--------+------------+--------+-------------+
| 2      | Junior     | 15000  | 25000       |
+--------+------------+--------+-------------+
| 3      | Junior     | 40000  | 65000       |
+--------+------------+--------+-------------+
| 4      | Senior     | 16000  | 16000       |
+--------+------------+--------+-------------+
| 5      | Senior     | 20000  | 36000       |
+--------+------------+--------+-------------+
| 6      | Senior     | 50000  | 86000       |
+--------+------------+--------+-------------+

In [11]:
select emp_id,max(time) as out_time from hospital 
    where action = 'out'
group by 1

+--------+---------------------+
| emp_id | out_time            |
+--------+---------------------+
| 1      | 2019-12-22 09:15:00 |
+--------+---------------------+
| 2      | 2019-12-22 09:15:00 |
+--------+---------------------+
| 3      | 2019-12-22 09:30:00 |
+--------+---------------------+
| 5      | 2019-12-22 09:40:00 |
+--------+---------------------+

In [16]:
with latest_in as (select emp_id,max(time) as in_time from hospital 
    where action = 'in'
group by 1),
latest_out as (select emp_id,max(time) as out_time from hospital 
    where action = 'out'
group by 1)

select * from latest_in a
left join latest_out b on
a.emp_id = b.emp_id

where in_time > out_time or out_time is null

+--------+---------------------+--------+---------------------+
| emp_id | in_time             | emp_id | out_time            |
+--------+---------------------+--------+---------------------+
| 2      | 2019-12-22 09:30:00 | 2      | 2019-12-22 09:15:00 |
+--------+---------------------+--------+---------------------+
| 3      | 2019-12-22 09:45:00 | 3      | 2019-12-22 09:30:00 |
+--------+---------------------+--------+---------------------+
| 4      | 2019-12-22 09:45:00 |        |                     |
+--------+---------------------+--------+---------------------+